In [32]:
import pandas as pd;
import numpy as np;
import matplotlib.pyplot as plt;

In [33]:
titanic_data=pd.read_csv("../../Datasets/Titanics/train.csv")
titanic_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## No of People Survived

In [34]:
total_male_count=titanic_data.loc[(titanic_data.Sex=='male')]['Sex'].count();
total_female_count=titanic_data.loc[(titanic_data.Sex=='female')]['Sex'].count();
female_survivors=titanic_data.loc[(titanic_data.Survived==1) & (titanic_data.Sex=='female')]['Survived'].count()
male_survivors=titanic_data.loc[(titanic_data.Survived==1) & (titanic_data.Sex=='male')]['Survived'].count()
print("Total Male Passengers:",total_male_count)
print("Total Female Passengers:",total_female_count)
print("Male Survivors:",male_survivors)
print("Female Survivors",female_survivors)

Total Male Passengers: 577
Total Female Passengers: 314
Male Survivors: 109
Female Survivors 233

In [35]:
survivorsdata=[total_male_count,male_survivors,total_female_count,female_survivors]
plt.bar(survivorsdata,height=0.5)
plt.show()

TypeError: bar() missing 1 required positional argument: 'height'